In [1]:
# https://pandas.pydata.org/pandas-docs/stable/reference/io.html

import pandas as pd
import numpy as np
from IPython.display import display,HTML,Latex

# 使用python内置模块pickle

一、什么是pickle模块？

什么是持续化模块?

持续化模块：就是让数据持久化保存。

pickle模块是Python专用的持久化模块，可以持久化包括自定义类在内的各种数据，比较适合Python本身复杂数据的存贮。

但是持久化后的字串是不可认读的，并且只能用于Python环境，不能用作与其它语言进行数据交换。

二、pickle模块的作用

把 Python 对象直接保存到文件里，而不需要先把它们转化为字符串再保存，也不需要用底层的文件访问操作，直接把它们写入到一个二进制文件里。pickle 模块会创建一个 Python 语言专用的二进制格式，不需要使用者考虑任何文件细节，它会帮你完成读写对象操作。用pickle比你打开文件、转换数据格式并写入这样的操作要节省不少代码行。

三、主要方法

在pickle中dumps()和loads()操作的是bytes类型，而在使用dump()和lload()读写文件时，要使用rb或wb模式，也就是只接收bytes类型的数据。

**注意：必须保持读写pickle文件的python的版本一致。**

In [2]:
original_df = pd.DataFrame({"foo": range(5), "bar": range(5, 10)})  
original_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [3]:
original_df.to_pickle("./dummy.pkl")

In [4]:
unpickled_df = pd.read_pickle("./dummy.pkl")  
unpickled_df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

# 使用python内置的csv模块

CSV (Comma Separated Values) ，即逗号分隔值（也称字符分隔值，因为分隔符可以不是逗号），是一种常用的文本

格式，用以存储表格数据，包括数字或者字符。

In [5]:
df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
                   'mask': ['red', 'purple'],
                   'weapon': ['sai', 'bo staff']})
df

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [6]:
df.to_csv(index=False)

'name,mask,weapon\r\nRaphael,red,sai\r\nDonatello,purple,bo staff\r\n'

In [7]:
df.to_csv('./dummy_1.csv', index=False)

In [8]:
df.to_csv(index=True)

',name,mask,weapon\r\n0,Raphael,red,sai\r\n1,Donatello,purple,bo staff\r\n'

In [9]:
df.to_csv('./dummy_2.csv',index=True)

In [10]:
pd.read_csv('./dummy_1.csv')

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [11]:
pd.read_table('./dummy_1.csv',sep=',')

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [12]:
pd.read_csv('./dummy_2.csv',usecols=['name','mask','weapon'])

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

# 使用第三方openpyxl

In [13]:
df1 = pd.DataFrame([['a', 'b'], ['c', 'd']],
                   index=['row 1', 'row 2'],
                   columns=['col 1', 'col 2'])
df1

      col 1 col 2
row 1     a     b
row 2     c     d

In [14]:
df1.to_excel('./output_1.xlsx')

In [15]:
pd.read_excel('./output_1.xlsx', index_col=0)

      col 1 col 2
row 1     a     b
row 2     c     d

In [16]:
df1.to_excel("./output_2.xlsx", sheet_name='Sheet_name_1')  

# 追加到当前已经存在excel文档
with pd.ExcelWriter('./output_2.xlsx',
                    mode='a') as writer:  
    df.to_excel(writer, sheet_name='Sheet_name_3')

In [17]:
df2 = df1.copy()
with pd.ExcelWriter('./output_3.xlsx') as writer:  
    df1.to_excel(writer, sheet_name='Sheet_name_1')
    df2.to_excel(writer, sheet_name='Sheet_name_2')

In [18]:
pd.read_excel('./output_3.xlsx', index_col=0, sheet_name='Sheet_name_2')

      col 1 col 2
row 1     a     b
row 2     c     d

In [19]:
## 使用openpyxl来操控excel的样式
## https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.ExcelWriter.html
## To DO

# 使用python内置json模块

In [20]:
df = pd.DataFrame([['a', 'b'], ['c', 'd']],
                  index=['row 1', 'row 2'],
                  columns=['col 1', 'col 2'])
df

      col 1 col 2
row 1     a     b
row 2     c     d

In [21]:
df.to_json() # orient='records'

'{"col 1":{"row 1":"a","row 2":"c"},"col 2":{"row 1":"b","row 2":"d"}}'

In [22]:
df.to_json(orient='split')

'{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}'

In [23]:
df.to_json(orient='index')

'{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}'

In [24]:
df.to_json(orient='records')

'[{"col 1":"a","col 2":"b"},{"col 1":"c","col 2":"d"}]'

In [25]:
df.to_json(orient='values')

'[["a","b"],["c","d"]]'

In [26]:
df.to_json(orient='columns')

'{"col 1":{"row 1":"a","row 2":"c"},"col 2":{"row 1":"b","row 2":"d"}}'

In [27]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col 1","type":"string"},{"name":"col 2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row 1","col 1":"a","col 2":"b"},{"index":"row 2","col 1":"c","col 2":"d"}]}'

In [28]:
df.to_json('./dummy.json') # orient='records'

In [29]:
pd.read_json('./dummy.json')

      col 1 col 2
row 1     a     b
row 2     c     d

In [30]:
df.to_json('./dummy_1.json',orient='table')

In [31]:
pd.read_json('./dummy_1.json',orient='table')

      col 1 col 2
row 1     a     b
row 2     c     d

## Normalize semi-structured JSON data into a flat table.

In [32]:
data = [
    {"id": 1, "name": {"first": "Coleen", "last": "Volk"}},
    {"name": {"given": "Mark", "family": "Regner"}},
    {"id": 2, "name": "Faye Raker"},
]

data

[{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}},
 {'name': {'given': 'Mark', 'family': 'Regner'}},
 {'id': 2, 'name': 'Faye Raker'}]

In [33]:
pd.json_normalize(data)

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mark      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker

In [34]:
data = [
    {
        "id": 1,
        "name": "Cole Volk",
        "fitness": {"height": 130, "weight": 60},
    },
    {"name": "Mark Reg", "fitness": {"height": 130, "weight": 60}},
    {
        "id": 2,
        "name": "Faye Raker",
        "fitness": {"height": 130, "weight": 60},
    },
]
data

[{'id': 1, 'name': 'Cole Volk', 'fitness': {'height': 130, 'weight': 60}},
 {'name': 'Mark Reg', 'fitness': {'height': 130, 'weight': 60}},
 {'id': 2, 'name': 'Faye Raker', 'fitness': {'height': 130, 'weight': 60}}]

In [35]:
pd.json_normalize(data, max_level=0)

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mark Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [36]:
pd.json_normalize(data, max_level=1)

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60

In [37]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]
data

[{'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': [{'name': 'Dade', 'population': 12345},
   {'name': 'Broward', 'population': 40000},
   {'name': 'Palm Beach', 'population': 60000}]},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': [{'name': 'Summit', 'population': 1234},
   {'name': 'Cuyahoga', 'population': 1337}]}]

In [38]:
pd.json_normalize(
    data, "counties", ["state", "shortname", ["info", "governor"]]
)

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [39]:
data = {"A": [1, 2]}
data

{'A': [1, 2]}

In [40]:
pd.json_normalize(data, "A", record_prefix="Prefix.")

   Prefix.0
0         1
1         2

# 使用第三方lxml来解析html成dataframe

https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-read-html

In [41]:
df = pd.DataFrame([['a', 'b'], ['c', 'd']],
                  index=['row 1', 'row 2'],
                  columns=['col 1', 'col 2'])
df

      col 1 col 2
row 1     a     b
row 2     c     d

In [42]:
df_html = df.to_html()
print(df_html)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>col 1</th>
      <th>col 2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>row 1</th>
      <td>a</td>
      <td>b</td>
    </tr>
    <tr>
      <th>row 2</th>
      <td>c</td>
      <td>d</td>
    </tr>
  </tbody>
</table>

In [43]:
display(HTML(df_html))

In [44]:
df_lst = pd.read_html(df_html,index_col=0)
print(type(df_lst[0]))
df_lst[0]

<class 'pandas.core.frame.DataFrame'>

      col 1 col 2
row 1     a     b
row 2     c     d

# 使用第三方lxml来转换xml成dataframe

In [45]:
df = pd.DataFrame({'shape': ['square', 'circle', 'triangle'],
                   'degrees': [360, 360, 180],
                   'sides': [4, np.nan, 3]})
df

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

In [46]:
df_xml_1 = df.to_xml(index=False)
print(df_xml_1)

<?xml version='1.0' encoding='utf-8'?>
<data>
  <row>
    <shape>square</shape>
    <degrees>360</degrees>
    <sides>4.0</sides>
  </row>
  <row>
    <shape>circle</shape>
    <degrees>360</degrees>
    <sides/>
  </row>
  <row>
    <shape>triangle</shape>
    <degrees>180</degrees>
    <sides>3.0</sides>
  </row>
</data>

In [47]:
df_xml_2 = df.to_xml(attr_cols=['shape', 'degrees', 'sides'], index=False)
print(df_xml_2)

<?xml version='1.0' encoding='utf-8'?>
<data>
  <row shape="square" degrees="360" sides="4.0"/>
  <row shape="circle" degrees="360"/>
  <row shape="triangle" degrees="180" sides="3.0"/>
</data>

In [48]:
df_xml_3 = df.to_xml(namespaces={"doc": "https://example.com"}, prefix="doc", index=False)  
print(df_xml_3)

<?xml version='1.0' encoding='utf-8'?>
<doc:data xmlns:doc="https://example.com">
  <doc:row>
    <doc:shape>square</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides>4.0</doc:sides>
  </doc:row>
  <doc:row>
    <doc:shape>circle</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides/>
  </doc:row>
  <doc:row>
    <doc:shape>triangle</doc:shape>
    <doc:degrees>180</doc:degrees>
    <doc:sides>3.0</doc:sides>
  </doc:row>
</doc:data>

In [49]:
pd.read_xml(df_xml_1)

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

In [50]:
pd.read_xml(df_xml_2,xpath=".//row")

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

In [51]:
pd.read_xml(df_xml_3, xpath="//doc:row", namespaces={"doc": "https://example.com"})

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

# 使用第三方fastparquet或者pyarrow来转换dataframe成parquet文件

In [52]:
df = pd.DataFrame(data={'col1': [1, 2], 'col2': [3, 4]})
df

   col1  col2
0     1     3
1     2     4

In [53]:
df.to_parquet('df.parquet.gzip', compression='gzip')

In [54]:
pd.read_parquet('df.parquet.gzip')

   col1  col2
0     1     3
1     2     4

# 把dataframe转换成数据库的表

In [55]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [56]:
df = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3']})
df

     name
0  User 1
1  User 2
2  User 3

In [57]:
df.to_sql('users', con=engine)

3

In [58]:
engine.execute("SELECT * FROM users").fetchall()

[(0, 'User 1'), (1, 'User 2'), (2, 'User 3')]

In [59]:
with engine.begin() as connection:
    df1 = pd.DataFrame({'name' : ['User 4', 'User 5']})
    df1.to_sql('users', con=connection, if_exists='append')

In [60]:
df2 = pd.DataFrame({'name' : ['User 6', 'User 7']})
df2.to_sql('users', con=engine, if_exists='append')

2

In [61]:
engine.execute("SELECT * FROM users").fetchall()

[(0, 'User 1'),
 (1, 'User 2'),
 (2, 'User 3'),
 (0, 'User 4'),
 (1, 'User 5'),
 (0, 'User 6'),
 (1, 'User 7')]

In [62]:
df2.to_sql('users', con=engine, if_exists='replace',
           index_label='id')

2

In [63]:
engine.execute("SELECT * FROM users").fetchall()

[(0, 'User 6'), (1, 'User 7')]

In [64]:
df = pd.DataFrame({"A": [1, None, 2]})
df

     A
0  1.0
1  NaN
2  2.0

In [65]:
from sqlalchemy.types import Integer
df.to_sql('integers', con=engine, index=False,
          dtype={"A": Integer()})

3

In [66]:
engine.execute("SELECT * FROM integers").fetchall()

[(1,), (None,), (2,)]

In [67]:
from sqlite3 import connect
conn = connect(':memory:')
df = pd.DataFrame(data=[[0, '10/11/12'], [1, '12/11/10']],
                  columns=['int_column', 'date_column'])
df.to_sql('test_data', conn)

2

In [68]:
pd.read_sql('SELECT int_column, date_column FROM test_data', conn)

   int_column date_column
0           0    10/11/12
1           1    12/11/10

In [69]:
pd.read_sql('SELECT int_column, date_column FROM test_data',
            conn,
            parse_dates=["date_column"])

   int_column date_column
0           0  2012-10-11
1           1  2010-12-11

In [70]:
pd.read_sql('SELECT int_column, date_column FROM test_data',
            conn,
            parse_dates={"date_column": {"format": "%d/%m/%y"}})

   int_column date_column
0           0  2012-11-10
1           1  2010-11-12

In [71]:
# dataframe转换成latexbiao

In [72]:
df = pd.DataFrame(dict(name=['Raphael', 'Donatello'],
                  mask=['red', 'purple'],
                  weapon=['sai', 'bo staff']))
df

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [73]:
print(df.style.to_latex())
#print(df.to_latex(index=False))   # It is recommended instead to use `DataFrame.style.to_latex`

\begin{tabular}{llll}
 & name & mask & weapon \\
0 & Raphael & red & sai \\
1 & Donatello & purple & bo staff \\
\end{tabular}

In [74]:
display(Latex(df.style.to_latex()))

In [75]:
df = pd.DataFrame([[1, 2.2, "dogs"], [3, 4.4, "cats"], [2, 6.6, "cows"]],
                  index=["ix1", "ix2", "ix3"],
                  columns=["Integers", "Floats", "Strings"])
df = df.style.highlight_max()
df

In [76]:
df.to_latex()

'\\begin{tabular}{lrrl}\n & Integers & Floats & Strings \\\\\nix1 & 1 & 2.200000 & \\background-coloryellow dogs \\\\\nix2 & \\background-coloryellow 3 & 4.400000 & cats \\\\\nix3 & 2 & \\background-coloryellow 6.600000 & cows \\\\\n\\end{tabular}\n'

In [77]:
display(Latex(df.to_latex()))

# dataframe转换成stata

Stata 是一套提供其使用者数据分析、数据管理以及绘制专业图表的完整及整合性统计软件。它拥有很多功能，包含线性混合模型、均衡重复反复及多项式普罗比模式。用Stata绘制的统计图形相当精美。

https://www.stata.com/new-in-stata/pystata/
PyStata allows you to invoke Stata directly from any standalone Python environment and to call Python directly from Stata, thus, greatly expanding Stata's Python integration features.

In [78]:
df = pd.DataFrame({'animal': ['falcon', 'parrot', 'falcon',
                              'parrot'],
                   'speed': [350, 18, 361, 15]})
df

   animal  speed
0  falcon    350
1  parrot     18
2  falcon    361
3  parrot     15

In [79]:
df.to_stata('./animals.dta', write_index=False)

In [80]:
df = pd.read_stata('./animals.dta')  
df

   animal  speed
0  falcon    350
1  parrot     18
2  falcon    361
3  parrot     15

# 使用第三方tables来转换dataframe成HDF文件()
PyTables is a package for managing hierarchical datasets and designed to efficiently cope with extremely large amounts of data. PyTables is built on top of the HDF5 library and the NumPy package and features an object-oriented interface that, combined with C-code generated from Cython sources, makes of it a fast, yet extremely easy to use tool for interactively save and retrieve large amounts of data.

In [82]:
df = pd.DataFrame([[1, 1.0, 'a']], columns=['x', 'y', 'z'])  
df

   x    y  z
0  1  1.0  a

In [83]:
df.to_hdf('./store.h5', 'data')  
pd.read_hdf('./store.h5')

   x    y  z
0  1  1.0  a